// app/important-people/[id]/page.js
"use client"; // Mark this as a client component

import Footer from "@/app/components/navigation/footer";
import { usePathname } from "next/navigation";

// Sample data array
const data = [
  {
    id: 1,
    name: "วัดสวนสวรรค์",
    description:
      "วัดสวนสวรรค์ ถูกทิ้งร้างไปเมื่อ พ.ศ. 2463 ก่อนจะถูกบูรณะวัดใหม่และถูกรวมเข้ากับวัดคฤหบดีใน พ.ศ. 2519 ภายในตัววัดเหลือแค่อุโบสถกับเจดีย์ มีเสมาแบบพิเศษหักมุม ผู้เชี่ยวชาญสันนิษฐานว่าหลังจากถูกสร้างในสมัยอยุธยา น่าจะมีการบูรณะในช่วงรัชกาลที่ 1",
    description2:
      "อุโบสถวัดสวนสวรรค์ เป็นอาคารก่ออิฐถือปูนทรงสูงหลังคาไม่ซ้อนชั้น ซึ่งอาจสร้างขึ้นในสมัยอยุธยาตอนปลายถึงต้นรัตนโกสินทร์",
    description3:
      "ภายในอุโบสถประดิษฐาน “หลวงพ่อดำ” เป็นพระพุทธรูปประธานปางมารวิชัย ถูกสันนิษฐานว่าเป็นพระพุทธรูปเก่าแก่ช่วงสมัยอยุธยาที่เคยปิดทองแต่หลุดลอกออกไปจนเหลือแต่เพียงสีดำ โดยข้างๆมีพระสาวก 2 องค์ยืนถวายอัญชลี ผนังภายในสองข้างเจาะช่องเว้ารูปวงโค้ง ยอดแหลมเรียงกัน ด้านหลังพระประธานไม่มีประตูแต่เจาะหน้าต่างเล็กๆ 2 ช่อง บนเพดานเขียนลายทองบนพื้นแดง ยังคงอยู่ในสภาพดี ส่วนโดยรอบด้านนอกมีร่องรองการบูรณะในภายหลัง",
    description4:
      "ซึ่งสิ่งก่อสร้างเหล่านี้กระจุกตัวอยู่ในพื้นที่แคบๆ ที่ล้อมด้วยชุมชน ในขณะที่บางส่วนได้ตกเข้าไปอยู่ในบริเวณบ้านคนที่รุกล้ำพื้นที่วัด ในปัจจุบันชาวบ้านโดยรอบเริ่มเห็นความสำคัญของโบราณสถานอย่างวัดสวนสวรรค์ จึงได้มีการจัดการทำความสะอาดและอนุรักษ์อุโบสถตามกำลังที่มี และเปิดให้ผู้คนทั่วไปได้เข้ามากราบไหว้นมัสการหลวงพ่อดำ",
    image: "/assests/images/วัดสวนสวรรค์.jpg",
  },
  {
    id: 2,
    name: "โรงทำขนมจีน",
    description:
      "ถัดออกไปจากโรงเตาใกล้กับบริเวณท่าล่างจะเป็นโรงงานทำขนมจีนขนาดใหญ่ โดยชาวจีนชื่อ ยายเนี้ยว ไม่ทราบนามสกุล โรงงานทำขนมจีนตั้งอยู่บนที่ดินของตระกูลธนภูมิ",
    description2:
      "ในอดีตจะมีเรือมารับขนมจีนในบริเวณนี้ จนกระทั่งเรียกว่า โรงทำขนมจีน ส่วนใหญ่พ่อค้าแม่ค้าจะนำเรือมาเทียบท่าเพื่อรับขนมจีนและนำไปขายยังตลาดต่างๆ เช่น ตลาดเทเวศร์ ตลาดบางลำพู ตลาดสามเสน เป็นต้น",
    description3:
      "ในปัจจุบัน โรงขนมจีนได้ปิดตัวลง เหลือเพียงตัวอาคารที่ได้ปรับเปลี่ยนให้เป็นบ้านเช่าราคาถูกสำหรับผู้มีรายได้น้อยให้เข้ามาเช่าอยู่อาศัยแทน",
    image: "/assests/images/โรงทำขนมจีน.jpg",
    image2: "/assests/images/อาชีพปัจจุบัน.jpg",
  },
  {
    id: 3,
    name: "โรงเตาอั่งโลและโรงปูน",
    description:
      "ชุมชนบ้านปูนเดิมที แบ่งเป็นท่าบนและท่าล่าง โดยชุมชนบ้านปูนในปัจจุบันคือส่วนของ “ท่าบน” เป็นที่อยู่อาศัยของชาวบ้านมาตั้งแต่อดีต เดิมทีบริเวณนี้เป็นที่ตั้งของโรงทำเตาอั้งโล่ เรียงติดกันจำนวน 4 - 5 โรง",
    description2:
      "ในอดีตจะมีเรือท้องแบนลำใหญ่ขนดินเลนจากคลองแถบรังสิตมาเทียบท่า ใส่กรอบไม้สีเหลี่ยมวางเรียงบนบก ผึ่งให้น้ำซึมออกจากดินเลน เมื่อน้ำออกจนหมดจึงจะนำดินเลนมาผสมขี้เถ้าดำ (แกลบดำ) แล้วใช้เท้าเหยียบผสมให้เป็นเนื้อเดียวกัน แบ่งดินเลนที่ผสมออกเป็นก้อนๆ ตากแดดพอหมาดแล้วนำมาขึ้นรูปด้วยการกดดินเลนลงบนโครงแบบ ก่อนจะนำกลับไปคว่ำตากแดดอีกครั้ง จึงจะนำมาใส่หูเจาะรูสำหรับใส่ถ่าน ชุบน้ำ และนำเข้าเตาเผา โดยการเผาด้วยแกลบเชื้อเพลิง นำตะกับมาวางและเก็บขอบให้พอดีกับเตาที่เผาเสร็จ จากนั้นใช้ดินปาดขอบให้ตะกับและเตาติดกัน บ้างก็นำเตามาใส่ถังสังกะสี ยัดขี้เถ้าระหว่างช่องว่างจนเต็ม แล้วใช้ปูนซีเมนต์ปาดปิดรู หลังจากทำเสร็จ ทางโรงทำเตาอั้งโล่ก็จะลงเรือล่องไปส่งตามร้านต่างๆ ทั้งในละแวกนั้น และล่องขึ้นไปบางซื่อถึงสิงห์บุรี แต่ในปัจจุบัน ด้วยเทคโนโลยีการผลิตที่ทันสมัยและการใช้เตาอั้งโล่ที่ลดน้อยลง รวมทั้งการเปลี่ยนแปลงของชุมชนบ้านปูนในยุคหลังจึงทำให้กิจการดังกล่าวเลิกไปโดยปริยาย",
    description3:
      "โรงปูน มีอาณาเขตอยู่ที่ลานกลางบ้านของชุมชนบ้านปูน และบริเวณใกล้เคียง ลักษณะของเตาเผาปูน เป็นเตาขนาดใหญ่ก่อด้วยอิฐมอญ (อิฐแดง) มีขนาดความกว้างแลความสูงขนาดประมาณ 5 - 6 เมตร ด้านหน้าเตามีช่องสำหรับใส่ฟืนและใส่หินเพื่อให้ไฟลุกโชนได้อย่างทั่วถึง ส่วนด้านบนของเตาจะเปิดโล่งให้อากาศถ่ายเทและสามารถระบายควันไฟจากการเผาปูนได้",
    description6:
      "ในขั้นที่ 4 นี้ บางครั้งจะนำสีเสียดบดละเอียดลงผสมด้วยบางส่วน เพื่อให้ปูนมีรสสัมผัสที่ดีขึ้น เนื่องจากความฝาดของสีเสียดที่ผสมลงไปจะช่วยไม่ให้ปูนกัดปาก แต่ปูนผสมสีเสียดจะมีราคาแพงกว่าปูนธรรมดา ซึ่งเตาปูนที่ใช้สีเสียดผสมเป็นเตาขนาดเล็กเพราะมีปริมาณน้อย",
    image: "/assests/images/โรงเตาอั้งโล่และโรงปูน.jpg",
    image2: "/assests/images/โรงเตาอั่งโล2.webp",
    image3: "/assests/images/OldCement.jpg",
  },
  {
    id: 4,
    name: "โรงฝิ่น",
    description:
      "โรงยาฝิ่น ถูกสร้างขึ้นเพื่อเป็นที่ผ่อนคลายให้กับลูกจ้างในโรงสุราบางยี่ขันและผู้คนรอบข้างในบริเวณโดยรอบ ก่อนจะถูกยุบไปในช่วง พ.ศ. 2501 หลังจากการประกาศของคณะปฏิวัติให้เลิกเสพฝิ่นและจำหน่าย ทำให้โรงยาฝิ่นแห่งนี้ถูกยุบไป โดยพื้นที่แห่งนี้แต่เดิมเป็นของคุณหญิงเติมธนภูมิ หลังจากเลิกกิจการ ในเวลาต่อมาได้ทำการปล่อยเช่าในนามของตระกูลธนภูมิ",
    image: "/assests/images/โรงฝิ่น.jpg",
  },
  {
    id: 5,
    name: "ศาลาโรงธรรม",
    description:
      "เป็นศาลาใต้ถุนสูงชั้นเดียว ยกพื้นสำหรับพระสงฆ์เจริญพระพุทธมนต์ สูงกว่าระดับพื้นปกติประมาณ 60 ซม. พอก้าวขึ้นลงได้สะดวก ตรงกลางตั้งธรรมาสน์สำหรับพระสงฆ์เทศน์ ใต้ถุนศาลาโรงธรรมด้านที่ยกพื้นสูงแต่เดิมมีเรือเก็บเอาไว้ 1 ลำ จอมพลประภาส จารุเสถียร ได้กล่าวไว้ในหนังสืออัตชีวประวัติของท่านว่า บรรพบุรุษของท่านบอกเล่าไว้ว่า เรือลำดังกล่าวใช้เป็นพาหนะหนีพม่าลงมาจากกรุงศรีอยุธยาก่อนที่กรุงเก่าจะเสียแก่พม่า ในปันจุบันเรือลำนี้ชำรุดผุพังและสูญหายไปแล้ว",
    description2:
      "ศาลาโรงธรรมแห่งนี้ตั้งอยู่บริเวณหลังตลาดบ้านปูน เกือบจะอยู่กลางหมู่บ้านของชุมชน ดังนั้นบางทีจึงเรียกว่า “ศาลากลางบ้าน” ใช้สำหรับทำบุญร่วมกัน สันนิษฐานว่าสร้างขึ้นเมื่อชุมชนกลุ่มแรกเข้ามาตั้งหลักแหล่งอย่างมั่นคงแล้วในช่วงสมัยของกรุงธนบุรี มีความเป็นไปได้ว่าศาลาโรงธรรมแห่งนี้ได้แบบอย่างมาตั้งแต่ครั้งชุมชนรุ่นแรกยังอยู่ในกรุงศรีอยุธยา",
    image: "/assests/images/ศาลาโรงธรรม.jpg",
    image2: "/assests/images/ศาลาโรงธรรม2.jpg",
  },
  {
    id: 6,
    name: "บ้านตีมีด",
    description:
      "บ้านตีมีด เป็นธุรกิจเล็กๆของคุณลุงไสวและครอบครัว ที่ย้ายจากจังหวัดนครสวรรค์มายังชุมชนบ้านปูน บางยี่ขัน เพื่อหาเงินให้เพียงพอต่อค่าครองชีพในแต่วัน จึงได้นำทักษะการตีมีดที่ติดไม้ติดมือของตนมาใช้ โดยการรับทำมีดและกรรไกรตัดผมแบบโบราณ ด้วยความคม ความประณีต และความชำนาญ ทำให้ชื่อเสียงของลุงไสวเป็นที่รู้จักไปทั่วในย่านนั้น หลังจากลุงไสวเสียชีวิต ลูกหลานก็ไม่ได้ทำการสืบทอด และได้ย้ายออกจากชุมชนไป คงเหลือไว้เพียงเรื่องเล่าที่ครั้งนึงเคยมีช่างตีมีดมือดีในชุมชนบ้านปูน",
    image: "/assests/images/บ้านตีมีด.jpg",
  },
  {
    id: 7,
    name: "โรงสุราบางยี่ขัน",
    description:
      "หลังจากการทำสงครามไทยลาว เจ้าตัสสะ พระอนุชาต่างมารดาของเจ้าอนุวงศ์ ได้ตัดสินใจยอมจำนนต่อฝ่ายไทย และได้รับการแต่งตั้งเป็น “นายอากร” ผูกขาดสุราของบางกอก โดยมีสมาคมนักลงทุนชาวจีนดูแลสัญญาและข้อตกลงทางธุรกิจว่าด้วยการผูกขาดของพระองค์ กระทั่งในที่สุดได้ก่อตั้งโรงกลั่นสุราบริเวณริมน้ำบางยี่ขัน หรือบริเวณที่ตั้งเดิมของวังลาว (ปัจจุบันพื้นที่นี้กลายมาเป็นสวนหลวงพระราม 8 และสถาบันดนตรีกัลยาณิวัฒนา)",
    description2:
      "โดยชุมชนบ้านปูนเป็นชุมชนแรกในย่านฝั่งธนบุรีที่สร้างโรงสุราขึ้นมาในพื้นที่ 31 ไร่ ซึ่งการตั้งโรงงานสุราทำให้กลุ่มแรงงานชาวจีนเข้ามาเป็นคนงานและมาตั้งถิ่นฐานในย่านบางยี่ขันมากขึ้น นอกจากจะเข้ามาทำงานแล้ว บางส่วนได้ยึดอาชีพค้าขายพายเรือไปตามลำคลอง เปิดโรงฝิ่นบริเวณริมแม่น้ำให้บริการผู้คนในย่านบางยี่ขัน โดยเฉพาะกลุ่มกุลีในโรงงานสุรา ซึ่งคนกลุ่มนี้มีหัวหน้าควบคุมและขึ้นอยู่กับการบังคับบัญชาของนายอากร ต่อมาเมื่อรัฐบาลยกเลิกการผูกขาดการต้มกลั่นและจำหน่ายสุรา ก็ได้มอบการควบคุมดูแลให้กับกรมสรรพสามิตในปี พ.ศ. 2475 ชาวจีนที่เคยทำงานในโรงสุราเดิมก็เปลี่ยนสังกัดไปอยู่กับกรมสรรพสามิต และในช่วงหลังปี พ.ศ. 2503 เป็นต้นมา ได้เปิดให้บริษัทสุรามหาราษฎรเข้ามารับช่วงสัมปทานโรงงานสุราบางยี่ขัน และดำเนินกิจการจนกระทั่งโรงงานแห่งนี้ปิดตัวลงในปี พ.ศ. 2538 หลังจากโรงงานปิดตัวลง คนงานในโรงงานบางส่วนได้ลาออกจากงาน แต่ยังคงปักหลักปักฐานประกอบอาชีพค้าขายในย่านบางยี่ขันอยู่ บางส่วนได้ย้ายไปทำงาน ณ โรงงานแห่งใหม่ในจังหวัดปทุมธานี บางอาคารถูกรื้อเพื่อเป็นที่ตั้งของคอสะพานพระราม 8 ในปัจจุบันพื้นที่และอาคารของโรงสุราเดิมได้เปลี่ยนเป็นสถานที่ทำการของสำนักงานโครงการอันเนื่องมาจากพระราชดำริ (มูลนิธิชัยพัฒนา) สถาบันอาหาร และสถาบันดนตรีกัลยาณิวัฒนา",
    image: "/assests/images/โรงสุราบางยี่ขัน.jpg",
  },
  {
    id: 8,
    name: "กำแพงวังเจ้าอนุวงศ์",
    description:
      "กำแพงวังเจ้าอนุวงศ์ หรือ วังเจ้าลาว สันนิษฐานว่าซากกำแพงดังกล่าวคือ วังของเจ้าอนุวงศ์ หนึ่งในสามของเชื้อพระวงศ์เวียงจันทน์อันได้แก่ เจ้านันทเสน เจ้าอินทวงศ์ และเจ้าอนุวงศ์ ซึ่งถูกนำตัวเข้ามาเมื่อครั้งกองทัพกรุงธนบุรีตีนครเวียงจันทน์เมื่อ พ.ศ. 2322 แล้วโปรดเกล้าฯ พระราชทานที่ดินและวังให้เป็นที่ประทับ ณ บางยี่ขัน ซึ่งเป็นหลักฐานของการเข้ามาอยู่อาศัยของเจ้านายจากกรุงเวียงจันทน์ ประเทศลาว ในช่วงรัชกาลที่ 3",
    description2:
      "ปัจจุบันซากกำแพงวังได้ขึ้นทะเบียนโบราณสถานของกรมศิลปากรและกลายเป็นเส้นแบ่งอาณาเขตของชุมชนบ้านปูนกับพื้นที่สะพานพระราม 8 ทอดตัวเลียบไปกับที่พักอาศัย โดยมีทางเข้า-ออกเล็กๆ ด้านบนเป็นป้ายสีเขียวเขียนชื่อระบุชัดว่า ‘ชุมชนบ้านปูน แขวงบางยี่ขัน เขตบางพลัด กรุงเทพมหานคร’ อยู่ที่ปลายกำแพงริมแม่น้ำ",
    image: "/assests/images/กำแพงวังเจ้าอนุวงศ์.jpg",
  },
  {
    id: 9,
    name: "ศาลเจ้าปึงเถ้ากง",
    description:
      "ศาลเจ้าปึงเถ้ากง เป็นศาลเจ้าเก่าแก่ที่อยู่คู่ชุมชนมาอย่างยาวนาน ชาวบ้านให้ความเคารพนับถือ เทพประธานของศาลแห่งนี้ คือ เทพปึงเถ้ากง (ปึงเถ่ากง ปูนเถ้ากง โทวตี่กง) หรือ อากง ความหมายในภาษาไทยคือ ปู่ ตามความเชื่อโบราณเชื่อว่าแต่ละท้องที่จะมีเทพประจำถิ่น โดยชาวจีนแต้จิ๋วเรียกว่า “ตี่เถ่าเล่าเอี๊ย” หรือ “เทพผู้เป็นใหญ่ ณ ที่นั้น” ไม่ว่าชาวจีนจะอพยพไปอยู่ที่ใดก็ยังยึดมั่นความเชื่อนี้อยู่ จึงได้แกะสลักรูปของเทพตี่เถ่าเล่าเอี๊ยจากไม้ขึ้นมาเพื่อเคารพบูชา ภายหลังเรียกอย่างง่ายๆ ว่า “ปึนเถ้ากง”",
    description2:
      "ปึงเถ้ากงเป็นเทพเจ้าองค์เดียวกับแป๊ะกง เทพเจ้าที่ดิน ซึ่งมีอยู่ทั่วไปในเมืองจีนตามชุมชนต่างๆ ในสังคมสมัยก่อนมีบทบาทสำคัญมาก เช่น ละครงิ้วหลายเรื่องจะถ่ายทอดให้เห็นว่ากษัตริย์ ขุนนาง หรือคนเดินทาง ใครที่ตกอยู่ในความลำบากก็จะไปอาศัยศาลแป๊ะกง เป็นที่พักแรม ที่หลบภัย หรือร้องทุกข์กับเทพเจ้า แป๊ะกง ถึงเป็นเทพระดับล่าง แต่ก็มีหน้าที่ส่งรายงานขึ้นไปยังเบื้องบน",
    description3:
      "ปึงเถ่ากงจึงเป็นเทพเจ้าในใจของคนที่ทำการค้า ซึ่งคนค้าขายส่วนใหญ่จะอาศัยอยู่ในเมือง หรือ ชุมชนขนาดใหญ่ ประกอบกับการขยายตัวของสังคมเมือง ปึงเถ่ากง จึงกลายเป็นเทพเจ้าของคนในเมือง ขณะที่คนในชนบทที่ห่างไกลออกไปยังคงนับถือและเรียกท่านว่า “แป๊ะกง” เช่นเดิม โดยชาวจีนแต้จิ๋วจะนิยมอัญเชิญท่านไว้ที่หิ้งบนพื้น เพราะถือว่าท่านเป็นเทพเจ้าที่ดิน",
    image: "/assests/images/ศาลเจ้าปึงเถ้ากง.jpg",
    image2: "/assests/images/Shrine.jpg",
  },
];

const CulturalDetail = () => {
  const pathname = usePathname(); // Get the current pathname
  const id = Number(pathname.split("/").pop()); // Convert the id to a number

  // Check if the id is valid and retrieve the data
  const person = data.find((item) => item.id === id);

  if (!person) {
    return <p>Cultural not found.</p>;
  }

  return (
    <>
      <main className="flex flex-col px-4 sm:px-8 md:px-20 pb-10">
        <div className="flex flex-col mt-20 lg:mt-36 mb-20 lg:mb-36 justify-center mx-4 sm:mx-8 lg:mx-20 2xl:mx-96">
          <p className="text-[#c53232] text-3xl sm:text-4xl md:text-5xl lg:text-7xl font-bold text-center">
            {person.name}
          </p>
          <div className="mx-0 sm:mx-10 lg:mx-20 2xl:mx-40 mt-10">
            <p className="text-white text-center">{person.description}</p>
          </div>
          <div
            className="h-[300px] sm:h-[400px] lg:h-[600px] bg-cover bg-center mt-10"
            style={{ backgroundImage: `url('${person.image}')` }}
          />
          <div className="space-y-6 sm:space-y-8 lg:space-y-10 mt-10">
            {person.description2 && (
              <p className="text-white text-start mx-5 lg:mx-14">
                {person.description2}
              </p>
            )}
            {person.description3 && (
              <p className="text-white text-start mx-5 lg:mx-14">
                {person.description3}
              </p>
            )}
            {person.id === 5 && (
              <p className="text-white text-start mx-5 lg:mx-14">
                การทำบุญที่ศาลาโรงธรรม อาจแยกกล่าวเป็น 3 ระยะ คือ
                <ul className="list-disc pl-6 sm:pl-10 space-y-3 lg:space-y-5">
                  <li>
                    ระยะแรก (ตั้งแต่เริ่มแรก - ประมาณ 60 ปีที่แล้ว)
                    มีการทำบุญในเทศกาลเข้าพรรษา มีพระธรรมเทศนาทุกวันในเวลา 17.00
                    น. นิมนต์พระสงฆ์มาเจริญพระพุทธมนต์
                    เลี้ยงพระในตอนเช้าเฉพาะในวันพระ (วันอุโบสถ)
                    และการเทศนาที่มีผู้รับเป็นเจ้าภาพหมุนเวียนกันไปคนละ 7 วัน
                    ดังนั้นในเทศกาลเข้าพรรษา 3 เดือน มีวันอุโบสถ 13 วัน
                    ก็จะมีเจ้าภาพ 13 คน
                    <br />
                    <br /> ส่วนการเลี้ยงพระนั้น
                    คนในชุมชนจะจัดอาหารทั้งคาว-หวานไปถวายพระ
                    และจัดเตรียมภาชนะชั่วคราว
                    ส่วนใหญ่ใช้กระทงใบตองแห้งสำหรับใส่อาหารแลกเปลี่ยนกันระหว่างผู้ที่มาทำบุญ
                    ด้วยกัน นอกจากเป็นการเชื่อมความสามัคดีต่อกันแล้ว
                    ยังเป็นการอวดฝีมือในการทำอาหารของกันและกันอีกด้วย
                  </li>
                  <li>
                    ระยะที่สอง (ตั้งแต่ประมาณ 60 ปีที่แล้ว - ประมาณ 20
                    ปีที่แล้ว)
                    เนื่องจากค่าครองชีพสูงขึ้นและผู้คนมีกิจธุระส่วนตัวมากขึ้น
                    ดังนั้น การทำบุญที่ศาลาโรงธรรม
                    จึงกระทำเฉพาะวันอุโบสถในช่วงเข้าพรรษา โดยเวลาเย็นของวันโกน
                    (ก่อนวันอุโบสถ 1 วัน) จะมีการเทศน์
                    โดยวันรุ่งขึ้นก็ทำบุญเลี้ยงพระ เช่นเดียวกับระยะที่หนึ่ง
                  </li>
                  <li>
                    ระยะที่สาม (ประมาณ 20 ปี - ปัจจุบัน)
                    ภาวะค่าครองชีพและการทำมาหากินรัดตัวขึ้น
                    คนส่วนใหญ่ต้องไปประกอบอาชีพ หาเงินใช้จ่ายเลี้ยงครอบครัว
                    ดังนั้นจึงเปลี่ยนการทำบุญจากวันอุโบสถมาเป็นวันอาทิตย์
                    โดยรวมการเทศน์และการเลี้ยงพระในวันเดียวกัน
                    <br />
                    <br />
                    นอกจากการเทศน์และทำบุญเลี้ยงพระที่ได้กล่าวมานั้น
                    ในปัจจุบันเมื่อถึงวันสงกรานต์และวันขึ้นปีใหม่ (1 มกราคม)
                    ได้มีการนิมนต์เจ้าอาวาสวัดคฤหบดี และวัดดาวดึงส์
                    สลับกันปีละวัด มาถวายน้ำสรงที่ศาลาโรงธรรม
                    เป็นการฉลองปีใหม่และรับพรตามแบบโบราณ
                  </li>
                </ul>
              </p>
            )}
            {person.image2 && (
              <div
                className="h-[300px] sm:h-[400px] lg:h-[600px] bg-cover bg-center mt-10"
                style={{ backgroundImage: `url('${person.image2}')` }}
              />
            )}
            {person.description4 && (
              <p className="text-white text-start mx-5 lg:mx-14">
                {person.description4}
              </p>
            )}
            {person.id === 3 && (
              <p className="text-white text-start mx-5 lg:mx-14">
                วัตถุดิบ ได้มาดังนี้
                <br /> หินปูน - ซื้อมาจากเมืองราชบุรี บรรทุกเรือมา
                <br />
                ขมิ้น - คาดว่ามาจากราชบุรี สมุทรสงคราม และสมุทรสาคร
                <br /> ฟืน - ใช้ฟืนไม้แสม ได้มาจากสมุทรสาคร
                <br /> เกลือ - ได้จากนาเกลือ สมุทรสาคร{" "}
                <ul className="list-disc pl-6 sm:pl-10 space-y-3 lg:space-y-5">
                  <li>
                    ขั้นที่ 1 นำหินปูน (Lime Sionc) มาเรียงในเตาเผา
                    เว้นช่องสำหรับใส่ฟืน
                    หลังจากเรียงเรียบร้อยแล้วใช้ฟืนแสมเป็นเชื้อเพลิงในการเผาหินปูนจนร้อนแดง
                    ขั้นตอนนี้ใช้เวลาประมาณ 3 วัน
                  </li>
                  <li>
                    ขั้นที่ 2 ราไฟให้มอดแล้วทลายหินปูนที่ร้อนแดงลงมา
                    ใช้น้ำเย็นราดให้หินปูนแตกย่อยเป็นชิ้นเล็ก ๆ
                    เพื่อนำไปโม่ละเอียดเป็นปูนขาว
                  </li>
                  <li>
                    ขั้นที่ 3 นำขมิ้นชันลงครกกระเดื่อง
                    ตำและป่นให้ละเอียดเป็นผงขมิ้น
                  </li>
                  <li>
                    ขั้นที่ 4 นำปูนขาวและผงขมิ้นผสมในเตาปูน
                    กรองด้วยผ้าขาวบางไม่ให้เศษหินปูนหรือชิ้นขมิ้นลงไป
                    การผสมในขั้นนี้จะทำให้ส่วนผสมของปูนขาวและขมิ้นเป็นสีแดง
                    เติมเกลือแกงบางส่วนตามลงไป
                    ผสมจนได้ที่แล้วตักขึ้นรวมในเตาขนาดใหญ่
                    พร้อมที่จะนำออกไปใช้และขายต่อไป
                  </li>{" "}
                </ul>
              </p>
            )}
            {person.image3 && (
              <div
                className="h-[300px] sm:h-[400px] lg:h-[600px] bg-cover bg-center mt-10"
                style={{ backgroundImage: `url('${person.image3}')` }}
              />
            )}
            {person.description6 && (
              <p className="text-white text-start mx-5 lg:mx-14">
                {person.description6}
              </p>
            )}
          </div>
        </div>
      </main>
      <Footer />
    </>
  );
};

// // Use this export to allow the server to fetch params
// export async function generateStaticParams() {
//   // Fetch your dynamic IDs from an API if needed
//   return [
//     { id: "1" },
//     { id: "2" },
//     // Add more static paths if necessary
//   ];
// }

export default CulturalDetail;
