// app/important-people/[id]/page.js
"use client"; // Mark this as a client component

import { usePathname } from "next/navigation";

// Sample data array
const data = [
  {
    id: 1,
    name: "วัดสวนสวรรค์",
    description:
      "วัดสวนสวรรค์ ตั้งอยู่ซอยจรัญสนิทวงศ์ 44 ชุมชนบ้านปูน บางยี่ขัน ถูกทิ้งร้างไปเมื่อ พ.ศ.2463 ก่อนจะถูกบูรณะวัดใหม่และถูกรวมเข้ากับวัดคฤหบดีในพ.ศ. 2519 ภายในตัววัดเหลือแค่อุโบสถกับเจดีย์มีเสมาแบบพิเศษหักมุม ผู้เชี่ยวชาญสันนิษฐานว่าหลังจากถูกสร้างในสมัยอยุธยา น่าจะมีการบูรณะในช่วงรัชกาลที่ 1 อุโบสถวัดสวนสวรรค์ เป็นอาคารก่ออิฐถือปูนทรงสูงหลังคาไม่ซ้อนชั้น ซึ่งอาจสร้างขึ้นราวสมัยอยุธยาตอนปลาย ถึงต้นรัตนโกสินทร์ ภายในอุโบสถประดิษฐาน “หลวงพ่อดำ” เป็นพระพุทธรูปประธานปางมารวิชัย ถูกสันนิษฐานว่าเป็นพระพุทธรูปเก่าแก่ช่วงสมัยอยุธยาที่เคยปิดทองแต่หลุดลอกออกไปจนเหลือแต่รักสีดำ โดยข้างๆมีพระสาวก 2 องค์ยืนถวายอัญชลี ผนังภายสองข้างเจาะช่องเว้ารูปวงโค้ง ยอดแหลมเรียงกัน ด้านหลังพระประธานไม่มีประตูแต่เจาะหน้าต่างเล็ก ๆ สองช่อง บนเพดานเขียนลายทองบนพื้นแดง ที่ยังคงอยู่ในสภาพดี ส่วนโดยรอบพระอุโบสถมีร่องรองการบูรณะในภายหลัง",
    description2:
      "ซึ่งสิ่งก่อสร้างเหล่านี้กระจุกตัวอยู่ในพื้นที่แคบ ๆ ที่ล้อมด้วยชุมชนในขณะที่บางอย่างตกไปอยู่ในบริเวณบ้านคนที่รุกล้ำพื้นที่วัดเข้ามา ในปัจจุบันชาวบ้านโดยรอบเริ่มเห็นความสำคัญของโบราณสถานวัดสวนสวรรค์ มีการจัดการทำความสะอาดและอนุรักษ์อุโบสถตามกำลังที่มีกันในชุมชน ผู้คนทั่วไปได้เข้ามากราบไหว้นมัสการหลวงพ่อดำได้",
  },
  {
    id: 2,
    name: "โรงทำขนมจีน",
    description:
      "ถัดออกไปจากโรงเตาใกล้กับบริเวณท่าล่างจะเป็นโรงงานทำขนมจีนขนาดใหญ่ โดยชาวจีนชื่อ ยายเนี้ยว ไม่ทราบนามสกุล ซึ่งเช่าช่วงมาจากผู้เช่ารายแรกอีกทอดหนึ่ง โรงงานทำขนมจีนตั้งอยู่บนที่ดินของตระกูลธนะภูมิ ในอดีตจะมีเรือมารับขนมจีนในบริเวณนี้ จนกระทั่งเรียกว่า ทำโรงขนมจีน ส่วนใหญ่พ่อค้าแม่ค้าจะนำเรือมาเทียบเพื่อรับขนมจีนและนำไปขายยังตลาดต่าง ๆ เช่น ตลาดเทเวศร์ บางลำพู สามเสน เป็นต้น ในปัจจุบัน ทั้งโรงเตาอังโล่และโรงขนมจีนได้ปิดตัวลง เหลือเพียงตัวอาคารที่ได้ปรับเปลี่ยนให้เป็นบ้านเช่าราคาถูกสำหรับผู้มีรายได้น้อยให้เข้ามาเช่าอยู่อาศัย",
  },
  {
    id: 3,
    name: "โรงเตาอั่งโลและโรงปูน",
  },
  {
    id: 4,
    name: "โรงฝิ่น",
    description: "เป็นของคุณหญิงเติม ธนะภูมิ รอข้อมูล (ยังไม่เสร็จสมบูรณ์)",
  },
  {
    id: 5,
    name: "ศาลาโรงธรรม",
  },
  {
    id: 6,
    name: "บ้านตีมีด",
    description: "รอข้อมูล (ยังไม่เสร็จสมบูรณ์)",
  },
  {
    id: 7,
    name: "โรงสุราบางยี่ขัน",
    description:
      "หลังจากการทำสงครามไทยลาวหรือที่เรียกว่ากบฏเจ้าอนุวงศ์ เจ้าตัสสะซึ่งเป็นพระอนุชาต่างมารดาของเจ้าอนุวงศ์ทรงรับผิดชอบดูแลกองพันทหารทางตะวันออกของการศึกลาว และได้ตัดสินใจยอมจำนนต่อฝ่ายไทย เจ้าติสสะจึงได้รับการแต่งตั้งเป็น “นายอากร” ผูกขาดสุราของบางกอก โดยมีสมาคมนักลงทุนชาวจีนดูแลสัญญาและข้อตกลงทางธุรกิจว่าด้วยการผูกขาดของพระองค์ กระทั่งในที่สุดได้ก่อตั้งโรงกลั่นสุราบริเวณริมน้ำที่บางยี่ขัน บริเวณที่ตั้งเดิมของวังลาว (ประมวญ วิชาพูล, 2482: 78) (ปัจจุบันพื้นที่นี้กลายมาเป็นสวนหลวงพระราม 8 และสถาบันดนตรีกัลยาณิวัฒนา)",
    description2:
      "ชุมชนแรกที่สร้างโรงสุราพื้นที่ประมาณ31ไร่ การตั้งโรงงานสุราในพื้นที่ ทำให้กลุ่มแรงงานชาวจีนเข้ามาเป็นคนงานในโรงงานต้มกลั่นสุรา และมาตั้งถิ่นฐานในย่านบางยี่ขันมากขึ้นซึ่งนอกจากจะเข้ามาทำงานในโรงสุราแล้ว บางส่วนได้ยึดอาชีพค้าขายพายเรือไปตามลำคลอง เปิดโรงฝิ่นบริเวณริมแม่น้ำให้บริการคนในย่านบางยี่ขัน โดยเฉพาะกลุ่มกุลีในโรงงานสุราซึ่งคนกลุ่มนี้มีหัวหน้าควบคุมและขึ้นอยู่กับการบังคับบัญชาของนายอากรต่อมาเมื่อรัฐบาลยกเลิกการผูกขาดการต้มกลั่นและจำหน่ายสุรา มอบการควบคุมดูแลให้กับกรมสรรพสามิตในปี พ.ศ. ๒๔๗๕ ชาวจีนที่เคยทำงานในโรงงานสุราเดิมก็เปลี่ยนไปสังกัดอยู่กับกรมสรรพสามิต ก่อนจะโอนโรงงานสุราให้ไปขึ้นตรงกับกรมโรงงานอุตสาหกรรมในปี พ.ศ. 2485และในช่วงหลังปี พ.ศ. 2503 เป็นต้นมา ได้เปิดให้บริษัทสุรามหาราษฎรเข้ามารับช่วงสัมปทานโรงงานสุราบางยี่ขัน และดำเนินกิจการจนกระทั่งโรงงานแห่งนี้ปิดตัวลงในปี พ.ศ. 2538 หลังจากโรงงานปิดตัวลง คนงานในโรงงานบางส่วนได้ลาออกจากงาน แต่ยังคงปักหลักปักฐานประกอบอาชีพค้าขายอยู่ในย่านบางยี่ขัน บางส่วนได้ย้ายไปทำงาน ณ โรงงานแห่งใหม่ในจังหวัดปทุมธานี ส่งผลให้ท่าเรือหน้าโรงงานที่เคยคลาคล่ำไปด้วยคนงานซึ่งข้ามฝั่งไปย่านบางลำพูต้องปิดตัวลง อาคารโรงสุรา รวมทั้งอาคารอำนวยการถูกปล่อยทิ้งร้าง และบางอาคารถูกรื้อเพื่อเป็นที่ตั้งของคอสะพานพระราม 8 ปัจจุบันพื้นที่และอาคารของโรงสุราเดิมได้เปลี่ยนบทบาทเป็นสถานที่ทำการของสำนักงานโครงการอันเนื่องมาจากพระราชดำริ (กปร.มูลนิธิชัยพัฒนา) สถาบันอาหารและสถาบันดนตรีกัลยาณิวัฒนา",
  },
  {
    id: 8,
    name: "กำแพงวังเจ้าอนุวงศ์",
    description:
      "กำแพงวังเจ้าอนุวงศ์ หรือ วังเจ้าลาว สันนิษฐานว่าซากกำแพงดังกล่าวคือ วังของเจ้าอนุวงศ์ หนึ่งในสามของเชื้อพระวงศ์เวียงจันทน์อันได้แก่ เจ้านันทเสน เจ้าอินทวงศ์ และเจ้าอนุวงศ์ ซึ่งถูกนำตัวเข้ามาเมื่อครั้งกองทัพกรุงธนบุรีตีนครเวียงจันทน์เมื่อ พ.ศ. 2322 แล้วโปรดเกล้าฯ พระราชทานที่ดินและวังให้เป็นที่ประทับ ณ บางยี่ขัน ซึ่งเป็นหลักฐานของการเข้ามาอยู่อาศัยของเจ้านายจากกรุงเวียงจันทน์ ประเทศลาว ในช่วงรัชกาลที่ 3",
    description2:
      "ปัจจุบันซากกำแพงวังได้ขึ้นทะเบียนโบราณสถานของกรมศิลปากรและกลายเป็นเส้นแบ่งอาณาเขตของชุมชนบ้านปูนกับพื้นที่สะพานพระราม 8 ทอดตัวเลียบไปกับที่พักอาศัย โดยมีทางเข้า-ออกเล็กๆ ด้านบนเป็นป้ายสีเขียวเขียนชื่อระบุชัดว่า ‘ชุมชนบ้านปูน แขวงบางยี่ขัน เขตบางพลัด กรุงเทพมหานคร’ อยู่ที่ปลายกำแพงริมแม่น้ำ",
  },
  {
    id: 9,
    name: "ศาลเจ้าปึงเถ้ากง",
    description:
      "เป็นศาลเจ้าเก่าแก่ที่อยู่คู่ชุมชน ชาวบ้านให้ความเคารพนับถือ เทพประธานของศาลแห่งนี้ คือ เทพปึงเถ้ากง (ปึงเถ่ากง ปูนเถ้ากง โทวตี่กง) หรือ อากง ความหมายในภาษาไทย คือ ปู่ ตามความเชื่อโบราณเชื่อว่าแต่ละท้องที่มีเทพประจำถิ่น โดยชาวจีนแต้จิ๋วเรียกโดยทั่วไปว่า “ตี่เถ่าเล่าเอี๊ย” หรือ “เทพผู้เป็นใหญ่ ณ ที่นั้น” ไม่ว่าชาวจีนจะอพยพไปอยู่ที่ใดก็ยังยึดมั่นความเชื่อนี้อยู่ จึงได้แกะสลักรูปเคารพของเทพตี่เถ่าเล่าเอี๊ยจากไม้ขึ้นมาเพื่อเคารพบูชา ภายหลังเรียกอย่างง่ายๆ ว่า “ปึนเถ้ากง” ",
    description2:
      "ปึงเถ้ากงเป็นเทพเจ้าองค์เดียวกับแป๊ะกง เทพเจ้าที่ดิน ซึ่งมีอยู่ทั่วไปในเมืองจีนตามชุมชนต่างๆ มีศาลแป๊ะกงให้เห็นเสมอ ในสังคมสมัยก่อนมีบทบาทสำคัญมาก เช่น ละครงิ้วหลายเรื่องถ่ายทอดให้เห็นว่ากษัตริย์ ขุนนาง คนเดินทาง ใครตกอยู่ในความลำบากก็จะไปอาศัยศาลแป๊ะกง เป็นที่พักแรม ที่หลบภัย หรือร้องทุกข์กับเทพเจ้า แป๊ะกง ซึ่งเป็นเทพระดับล่าง มีหน้าที่ส่งรายงานขึ้นไปยังเบื้องบน ชื่อของ“ปึงเถ่ากง” ในภาษาแต้จิ๋วนั้นมีความหมายที่ดี คำว่า “ปึง” มาจาก “ปึงจี๊” แปลว่า เงินทุน คำว่า “เถ่า” มาจาก“เถ่าใช่” แปลว่า นิมิตหมายที่ดี ส่วนคำว่า “กง” ใช้เรียกผู้อาวุโส ผู้ชาย หรือหมายถึง ปู่, ตา ปึงเถ่ากงจึงเป็นเทพเจ้าในใจของคนที่ทำการค้า ซึ่งคนค้าขายส่วนใหญ่จะอาศัยอยู่ในเมือง หรือ ชุมชนขนาดใหญ่ ประกอบกับการขยายตัวของสังคมเมือง ปึงเถ่ากง จึงกลายเป็นเทพเจ้าของคนในเมือง ขณะที่คนในชนบทที่ห่างไกลออกไปยังคงนับถือและเรียกท่านว่า “แป๊ะกง” เช่นเดิม แป๊ะกงจึงกลายเป็นเทพเจ้าของคนในชนบท ขณะที่ปึงเถ่ากงเป็นเทพเจ้าของคนเมืองไปโดยปริยาย โดยชาวจีนแต้จิ๋วจะนิยมอัญเชิญท่านไว้ที่หิ้งบนพื้น เพราะถือว่าท่านเป็นเทพเจ้าที่ดิน ในการบูชาของแต่ละบ้านอาจมีรายละเอียดแตกต่างกันไปแล้วแต่คนนิยม เช่น บูชาดอกไม้สด มาลัย โหงวเจ้งจี้ (อู่จ่งจือ ) หรือ เมล็ดทั้งห้า คือข้าวเปลือก ข้าวสาร ข้าวเหนียวแดง เมล็ดถั่วเขียว เมล็ดถั่วแดง",
  },
];

const CulturalDetail = () => {
  const pathname = usePathname(); // Get the current pathname
  const id = Number(pathname.split("/").pop()); // Convert the id to a number

  // Check if the id is valid and retrieve the data
  const person = data.find((item) => item.id === id);

  if (!person) {
    return <p>Cultural not found.</p>;
  }

  return (
    <main className="flex flex-col px-4 sm:px-8 md:px-20 pb-10">
      <div className="flex mt-10 justify-center">
        <p className="text-[#c53232] text-3xl sm:text-4xl md:text-5xl lg:text-6xl font-bold text-center">
          {person.name}
        </p>
      </div>
      {id === 1 ? (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-y-0 lg:gap-x-20 px-4 sm:px-8 xl:px-[180px]">
          <div className="w-full lg:w-1/3 h-[300px] sm:h-[400px] lg:h-[600px] mt-8 rounded-[20px] lg:rounded-[50px] bg-gray-400" />
          <div className="w-full lg:w-2/3">
            <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
              {person.description}
            </p>
            {person.description2 && (
              <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
                {person.description2}
              </p>
            )}
          </div>
        </div>
      ) : id === 2 ? (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-y-0 lg:gap-x-20 px-4 sm:px-8 xl:px-[180px]">
          <div className="w-full lg:w-1/3 h-[300px] sm:h-[400px] lg:h-[600px] mt-8 rounded-[20px] lg:rounded-[50px] bg-gray-400" />
          <div className="w-full lg:w-2/3">
            <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
              {person.description}
            </p>
            <div className="flex flex-col sm:flex-row gap-y-8 sm:gap-y-0 gap-x-8 mt-8">
              <div className="w-full sm:w-1/2 h-[200px] lg:h-[300px] rounded-[20px] bg-gray-400" />
              <div className="w-full sm:w-1/2 h-[200px] lg:h-[300px] rounded-[20px] bg-gray-400" />
            </div>
          </div>
        </div>
      ) : id === 3 ? (
        <div className="flex flex-col w-full px-4 sm:px-8 xl:px-[180px]">
          <div className="flex flex-col xl:flex-row w-full gap-y-8 lg:gap-y-0 lg:gap-x-20">
            <div className="w-full xl:w-1/3 h-[300px] sm:h-[400px] lg:h-[600px] mt-8 rounded-[20px] lg:rounded-[50px] bg-gray-400" />
            <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8 w-full xl:w-2/3">
              <p className="font-bold text-[#735240]">โรงเตาอั่งโล่</p>{" "}
              ชุมชนบ้านปูนเดิมที เรียก ท่าบนและท่าล่าง ชุมชนบ้านปูนปัจจุบันเรียก
              &quot;ท่าบน&quot;
              เป็นที่อยู่อาศัยของชาวบ้านมาตั้งแต่อดีมีกำแพงอิฐที่สันนิษฐานว่าเป็นกำแพงวังเจ้าอนุวงศ์แบ่งอาณาเขตบริเวณใต้สะพานพระรามที่
              8 ในปัจจุบันเรียกว่า &quot;ท่าล่าง&quot; บริเวณริมแม่น้ำ ท่าบน
              เดิมเป็นที่ตั้งของโรงทำเตาอั้งโล่เรียงติดกันจำนวน 4 - 5 โรง
              <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
                ในอดีตจะมีเรือท้องแบนลำใหญ่มาเทียบท่า
                หลังจากขนดินเลนจากคลองแถบรังสิตใส่เรือมาจนเต็มก็ใช้คนกอบดินเลนขึ้นมาเรือใส่กรอบไม้สีเหลี่ยมที่วางเรียงบนบก
                ผึ่งให้น้ำซึมออกจากดินเลนเมื่อน้ำออกหมดจึงนำดินเลนมาผสมขี้เถ้าดำ(แกลบดำ)
                แล้วใช้เท้าเหยียบให้ดินเลนและขี้เถ้าผสมเป็นเนื้อเดียวกัน
                แบ่งดินเลนที่ผสมออกเป็นก้อนๆไปตากแดดพอหมาดแล้วนำมาขึ้นรูปด้วยการกดดินเลนลงโครงแบบ
                แล้วนำกลับไปคว่ำตากแดดอีกครั้ง พอหมาดได้ที่ จึงนำมาใส่หู
                เจาะรูสำหรับใส่ถ่าน ชุบน้ำนา และนำเข้าเตาเผา
                โดยเผาด้วยแกลบเชื้อเพลิง
                นำตะกับมาวางและเก็บขอบให้พอดีกับเตาที่เผาเสร็จ
                จากนั้นใช้ดินปาดขอบให้ตะกับและเตาติดกัน
                บ้างก็นำตามาใส่ถังสังกะสี ยัดขี้เถ้าระหว่างช่องว่างจนเต็ม
                แล้วใช้ปูนซีเมนต์ปาดบิดรูสำหรับคนที่ต้องการแบบสังกะสี
                หลังจากทำเสร็จ ทางโรงทำเตาอังโล่ ก็นำลงเรือล่องไปส่งตามร้านต่างๆ
                ทั้งในละแวก และล่องขึ้นไปบางชื่อ ถึงสิงห์บุรี แต่ในปัจจุบัน
                ด้วยเทคโนโลยีการผลิตที่ทันสมัย
                และการใช้เตาอั้งโล่ที่ลดน้อยลงรวมทั้งการเปลี่ยนแปลงของชุมชนบ้านปูนในยุคหลังจึงทำให้กิจการ
                ดังกล่าวเลิกไปโดยปริยาย
              </p>
            </p>
          </div>
          <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
            <p className="font-bold text-[#735240]">โรงปูน</p>
            จุดนี้มีอาณาบริเวณอยู่ที่ลานกลางบ้านของชุมชนบ้านปูนและบ้านที่อยู่บริเวณใกล้เคียงกับลานกลางบ้าน
            ลักษณะของเตาเผาปูนมีลักษณะเป็นเตาขนาดใหญ่ก่อด้วยอิฐมอญ (อิฐแดง)
            มีขนาดความกว้างและขนาดความสูงประมาณ 5-6 เมตร
            ด้านหน้าเตามีช่องสำหรับใส่ฟืนและใส่หินเพื่อให้ไฟลุกโชนอย่างทั่วถึง
            ส่วนด้านบนของเตาจะเปิดโล่งให้อากาศถ่ายเทและสามารถระบายควันไฟจากการเผาปูนได้
          </p>
          <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
            <p className="font-bold">วัตถุดิบ ได้มาดังนี้</p>
            หินปูน - ซื้อมาจากเมืองราชบุรี บรรทุกเรือมา <br /> ขมิ้น - เข้าใจว่า
            มาจากราชบุรี สมุทรสงคราม และสมุทรสาคร
            <br /> ฟืน - ใช้ฟืนไม้แสม ได้มาจากสมุทรสาคร <br />
            เกลือ - ได้จากนาเกลือ สมุทรสาคร
          </p>
          <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
            <p className="font-bold"> ขั้นตอนการทำปูน</p>
            <ul className="list-disc pl-6 ml-6">
              <li>
                ขั้นที่ 1 นำหินปูน (Lime Sionc) มาเสียงในเตาเผา
                เว้นช่องสำหรับใส่ฟืนเรียบร้อยแล้วใช้ฟืนแสมเป็นเชื้อเพลิงเผาหินปูนจนร้อนแดง
                ขั้นนี้ไข้เวลาประมาณ 3 วัน
              </li>
            </ul>
            <ul className="list-disc pl-6 ml-6">
              <li>
                ขั้นที่ 2 ราไฟให้มอดแล้วทลายหินปูนที่ร้อนแดงลงมา
                ใช้น้ำเย็นราดให้หินปูนแตกย่อยเป็นชิ้นเล็ก ๆ
                เพื่อนำไปโม่ละเอียดเป็นปูนขาว
              </li>
            </ul>
            <ul className="list-disc pl-6 ml-6">
              <li>
                ขั้นที่ 3 นำขมิ้นชันลงครกกระเดื่อง ตำและป่นให้ละเอียดเป็นผงขมิ้น
              </li>
            </ul>
            <ul className="list-disc pl-6 ml-6">
              <li>
                ขั้นที่ 4 นำปูนขาวและผงขมิ้นลงผสมในเตาปูน
                กรองด้วยผ้าขาวบางไม่ให้เศษหินปูนหรือชิ้นขมิ้นลงไป
                การผสมในขั้นนี้จะทำให้ส่วนผสมของปูนขาวและขมิ้นเป็นสีแดง
                เติมเกลือแกงลงไปตามตามส่วน
                ผสมจนได้ที่แล้วตักขึ้นรวมในเตาขนาดใหญ่
                พร้อมที่จะนำออกไปใช้และขายต่อไป
              </li>
            </ul>
          </p>
          <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
            ในขั้นที่ 4 นี้ บางครั้งจะนำสีเสียดบดละเอียดลงผสมตามส่วนด้วย
            เพื่อให้ปูนมีรสดีขึ้น
            เนื่องจากความฝาดของสีเสียดที่ผสมลงไปและช่วยไม่ให้ปูนกัดปาก
            ปูนผสมสีเสียดจะมีราคา ราคาแพงกว่าปูนธรรมดา
            เตาปูนที่ใช้สีเสียดผสมเป็นเตาขนาดเล็กเพราะมีปริมาณน้อย
          </p>
          <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
            ขอให้สังเกตคำว่า &quot;เตา&quot;
            ไม่ใช่เตาที่ตั้งภาชนะต้มหรือเคี่ยวปูน ที่เรียกว่า เตา
            เพราะมีลักษณะเป็นก้นกระทะกลมๆ เส้นผ่าศูนย์กลางประมาณ 1.2 เมตร
            มีความลึกประมาณ 2 เมตร ความจริงจะเรียกว่า เต้าปูน จะเข้าใจดี
            แต่เป็นเต้าขนาดยักษ์
          </p>
          <p className="text-black text-[18px] sm:text-[20px] md:text-[22px] lg:text-[25px] text-justify mt-8">
            การส่งไปขาย - ส่งขายทั่วไปทั้งในเขตกรุงเทพฯ และจังหวัดใกล้เคียง
            ส่วนใหญ่มีพ่อค้ามารับไปขายอีกทอดหนึ่ง
          </p>
          <div className="flex flex-col xl:flex-row xl:gap-x-10 gap-y-8">
            <div className="w-full xl:w-1/3 h-[400px] mt-8 rounded-[50px] bg-gray-400" />
            <div className="w-full xl:w-1/3 h-[400px] mt-8 rounded-[50px] bg-gray-400" />
            <div className="w-full xl:w-1/3 h-[400px] mt-8 rounded-[50px] bg-gray-400" />
          </div>
        </div>
      ) : id === 4 ? (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-x-20 px-4 lg:px-[180px]">
          <div className="w-full lg:w-1/3 h-[600px] mt-8 rounded-[50px] bg-gray-400" />
          <div className="text-black text-[25px] text-justify mt-8 w-full lg:w-2/3">
            <p className="mb-4">{person.description}</p>
            <p className="mt-8">{person.description2}</p>
          </div>
        </div>
      ) : id === 5 ? (
        <div className="flex flex-col w-full px-6 md:px-12 lg:px-[180px]">
          <div className="flex flex-col xl:flex-row w-full gap-y-8 lg:gap-x-20">
            <div className="w-full xl:w-1/3 h-[600px] mt-8 rounded-[50px] bg-gray-400" />
            <div className="w-full xl:w-2/3 mt-8 text-black text-[20px] md:text-[25px] text-justify">
              <p className="font-bold text-[#735240]">{person.name}</p>
              <p>
                ศาลาโรงธรรมในบ้านปูน เป็นศาลาใต้ถุนสูงชั้นเดียว
                ยกพื้นสำหรับพระสงฆ์เจริญพระพุทธมนต์ สูงกว่าระดับพื้นปกติประมาณ
                60 ชม. พอก้าวขึ้นลงได้สะดวก
                ตรงกลางตั้งธรรมาสน์สำหรับพระสงฆ์เทศน์
                ไต้ถุนศาลาโรงธรรมด้านที่ยกพื้นสูงแต่เดิมมีเรือเก่งเก็บเอาไว้ 1
                ลำ จอมพล ประกาส จารุเสถียร
                ได้กล่าวไว้ในหนังสืออัตชีวประวัติของท่านว่า
                บรรพบุรุษของท่านบอกว่า
                เรือลำดังกล่าวใช้เป็นพาหนะหนีพม่าลงมาจากกรุงศรีอยุธยาก่อนที่กรุงเก่าจะเสียแก่พม่า
                ในปันจุบันเรือลำนี้ชำรุดผุพังและสูญหายไปแล้ว
              </p>
              <p className="mt-8">
                ศาลาโรงธรรมแห่งนี้ตั้งอยู่บริเวณหลังตลาดบ้านปูน
                เกือบจะอยู่กลางหมู่บ้านของชุมชนบ้านปูน ดังนั้นบางทีจึงเรียกว่า
                ศาลากลางบ้าน ใช้สำหรับชุมชนในบ้านปูนทำบุญร่วมกัน
                เข้าใจว่าจะสร้างเมื่อชุมชนกลุ่มแรกมาตั้งหลักแหล่งมั่นคงแล้วประมาณสมัยกรุงธนบุรี
                คงจะได้แบบอย่างมาตั้งแต่ครั้งชุมชุมชนรุ่นแรกยังอยู่ในอยุธยา
              </p>
            </div>
          </div>

          <div className="text-black text-[20px] md:text-[25px] text-justify mt-8">
            <p>การทำบุญที่ศาลาโรงธรรม อาจแยกกล่าวเป็น 3 ระยะ คือ</p>
            <ul className="list-disc pl-4 ml-4">
              <li>
                ระยะแรก (ตั้งแต่เริ่มแรก จนถึงประมาณ 60 ปีที่แล้วมา)
                มีการทำบุญในเทศกาลเข้าพรรษา มีพระธรรมเทศนาทุกวันในเวลา 17.00 น.
                กับนิมนต์พระสงฆ์มาเจริญพระพุทธมนต์
                เลี้ยงพระในตอนเช้าเฉพาะในวันพระ (วันอุโบสถ)
                การเทศนามีผู้รับเป็นเจ้าภาพหมุนเวียนกันไปคนละ 7 วัน
                ดังนั้นในเทศกาลเข้าพรรษา 3 เดือน มีวันอุโบสถ 13 วัน
                ก็จะมีเจ้าภาพ 13 คน ส่วนการเลี้ยงพระนั้น
                ชุมชนในหมู่บ้านจัดอาหารคาว-หวานไปถวายพระ
                และจัดเตรียมภาชนะชั่วคราว
                ส่วนใหญ่ใช้กระทงใบตองแห้งสำหรับใส่อาหารแลกเปลี่ยนกันระหว่างผู้ที่มาทำบุญ
                นอกจากเป็นการเชื่อมความสามัคดีต่อกันแล้ว
                ยังเป็นการอวดฝีมือในการทำอาหารอีกด้วย
              </li>
              <li>
                ระยะพี่สอง (ตั้งแต่เมื่อประมาณ 60 ปีที่แล้วมา จนถึงประมาณ 20
                ปีที่แล้ว) เนื่องจากค่าครองชีพสูงขึ้นและผู้คนมีกิจธุระมากขึ้น
                ดังนั้งการทำบุญที่ศาโรงธรรม
                จึงกระทำเฉพาะวันอุโบสถในช่วงเข้าพรรษาโดยเวลาเย็นของวันโกน
                (ก่อนวันอุโบสถ 1 วัน) มีเทศน์ รุ่งขึ้นทำบุญเลี้ยงพระ
                เช่นเดียวกับระยะที่หนึ่ง
              </li>
              <li>
                ระยะที่สาม (เมื่อประมาณ 20 ปี จนถึงปัจจุบัน)
                ภาวะค่าครองชีพและการทำมาหากินรัดตัวขึ้น
                คนส่วนใหญ่ต้องไปประกอบอาชีพและทำการงาน
                ดังนั้นจึงเปลี่ยนการทำบุญจากวันอุโบสถมาเป็นวันอาทิตย์
                โดยรวมการเทศน์และการเลี้ยงพระในวันเดียวกัน
              </li>
            </ul>
          </div>

          <div className="text-black text-[20px] md:text-[25px] text-justify mt-8">
            ในขั้นที่ 4 นี้ บางครั้งจะนำสีเสียดบดละเอียดลงผสมตามส่วนด้วย
            เพื่อให้ปูนมีรสดีขึ้น
            เนื่องจากความฝาดของสีเสียดที่ผสมลงไปและช่วยไม่ให้ปูนกัดปาก
            ปูนผสมสีเสียดจะมีราคา ราคาแพงกว่าปูนธรรมดา
            เตาปูนที่ใช้สีเสียดผสมเป็นเตาขนาดเล็กเพราะมีปริมาณน้อย
          </div>

          <div className="text-black text-[20px] md:text-[25px] text-justify mt-8">
            นอกจากการเทศน์และทำบุญเลี้ยงพระดังได้กล่าวมาแล้วในปัจจุบันเมื่อถึงวันสงกรานต์และวันขึ้นปีใหม่
            (1 มกราคม) ได้นิมนต์เจ้าอาวาสวัดคฤหบดี และวัดดาวดึงส์ สลับกันปีละวัด
            มาถวายน้ำสรงที่ศาลาโรงธรรม
            เป็นการฉลองปีใหม่และรับพรตามแบบโบราณอีกด้วย
          </div>

          <div className="flex flex-col xl:flex-row gap-y-6 sm:gap-y-0 sm:gap-x-6 mt-8">
            <div className="w-full xl:w-1/3 h-[400px] rounded-[50px] bg-gray-400 mt-8 xl:mt-0" />
            <div className="w-full xl:w-1/3 h-[400px] rounded-[50px] bg-gray-400 mt-8 xl:mt-0" />
            <div className="w-full xl:w-1/3 h-[400px] rounded-[50px] bg-gray-400 mt-8 xl:mt-0" />
          </div>
        </div>
      ) : id === 6 ? (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-x-20 px-6 md:px-12 lg:px-[180px]">
          <div className="w-full lg:w-1/3 h-[600px] mt-8 rounded-[50px] bg-gray-400" />
          <div className="text-black text-[20px] md:text-[25px] text-justify w-full lg:w-2/3 mt-8 ml-0 lg:ml-8">
            <p>{person.description}</p>
            <p className="text-black text-[20px] md:text-[25px] text-justify mt-8">
              {person.description2}
            </p>
          </div>
        </div>
      ) : id === 7 ? (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-x-20 px-6 md:px-12 lg:px-[180px]">
          <div className="flex flex-col w-full lg:w-1/3">
            <div className="w-full h-[500px] mt-8 rounded-[50px] bg-gray-400" />
            <div className="w-full h-[300px] mt-8 rounded-[50px] bg-gray-400" />
            <div className="w-full h-[300px] mt-8 rounded-[50px] bg-gray-400" />
          </div>
          <div className="text-black text-[20px] md:text-[25px] text-justify mt-8 ml-0 lg:ml-8 w-full lg:w-2/3">
            <p>{person.description}</p>
            <p className="text-black text-[20px] md:text-[25px] text-justify mt-8">
              {person.description2}
            </p>
          </div>
        </div>
      ) : id === 8 ? (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-x-20 px-6 md:px-12 lg:px-[180px]">
          <div className="w-full lg:w-1/3 h-[600px] mt-8 rounded-[50px] bg-gray-400" />
          <div className="text-black text-[20px] md:text-[25px] text-justify w-full lg:w-2/3 mt-8 ml-0 lg:ml-8">
            <p>{person.description}</p>
            <p className="text-black text-[20px] md:text-[25px] text-justify mt-8">
              {person.description2}
            </p>
          </div>
        </div>
      ) : (
        <div className="flex flex-col lg:flex-row w-full gap-y-8 lg:gap-x-20 px-6 md:px-12 lg:px-[180px]">
          <div className="flex flex-col w-full lg:w-1/3">
            <div className="w-full h-[500px] mt-8 rounded-[50px] bg-gray-400" />
            <div className="w-full h-[300px] mt-8 rounded-[50px] bg-gray-400" />
          </div>
          <div className="text-black text-[20px] md:text-[25px] text-justify mt-8 ml-0 lg:ml-8 w-full lg:w-2/3">
            <p>{person.description}</p>
            <p className="text-black text-[20px] md:text-[25px] text-justify mt-8">
              {person.description2}
            </p>
          </div>
        </div>
      )}
    </main>
  );
};

// // Use this export to allow the server to fetch params
// export async function generateStaticParams() {
//   // Fetch your dynamic IDs from an API if needed
//   return [
//     { id: "1" },
//     { id: "2" },
//     // Add more static paths if necessary
//   ];
// }

export default CulturalDetail;
